{
  "hexagram_id": "hexagram_54",
  "number": 54,
  "king_wen_sequence": 54,
  "fu_xi_sequence": 54,
  "binary": "001011",
  "trigrams": {
    "upper": "zhen",
    "lower": "dui"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Kouei Mei",
    "english_name": "The Marriageable Maiden",
    "title": "54. Kouei Mei / The Marriageable Maiden",
    "judgment": "Kouei Mei indicates that under the conditions which it denotes action will be evil, and in no wise advantageous.",
    "image": "The trigram representing the waters of a marsh, and over it that for thunder, form Kouei Mei. The superior person, in accordance with this, having regard to the far distant end, knows the mischief that may be done at the beginning.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "nine",
        "text": "shows the younger sister married off in a position ancillary to the real wife. It suggests the idea of a person lame on one leg who yet manages to tramp along. Going forward will be fortunate."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows her blind of one eye, and yet able to see. There will be advantage in her maintaining the firm correctness of a solitary widow."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows the younger sister who was to be married off in a mean position. She returns and accepts an ancillary position."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows the younger sister who is to be married off protracting the time. She may be late in being married, but the time will come."
      },
      "5": {
        "position": "fifth",
        "type": "six",
        "text": "reminds us of the marrying of the younger sister of the king, when the sleeves of the princess were not equal to those of the still younger sister who accompanied her in an inferior capacity. The case suggests the thought of the moon almost full. There will be good fortune."
      },
      "6": {
        "position": "topmost",
        "type": "six",
        "text": "shows the young lady bearing the basket, but without anything in it, and the gentleman slaughtering the sheep, but without blood flowing from it. There will be no advantage in any way."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}