{
  "hexagram_id": "hexagram_53",
  "number": 53,
  "king_wen_sequence": 53,
  "fu_xi_sequence": 53,
  "binary": "110100",
  "trigrams": {
    "upper": "xun",
    "lower": "gen"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Tchien",
    "english_name": "Gradual Progress",
    "title": "53. Tchien / Gradual Progress",
    "judgment": "Tchien suggest to us the marriage of a young lady, and the good fortune attending it. There will be advantage in being firm and correct.",
    "image": "The trigram representing a mountain, and above it that for a tree, form Tchien. The superior person, in accordance with this, attains to and maintains their extraordinary virtue, and makes the manners of the people good.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows the wild geese gradually approaching the shore. A young officer in similar circumstances will be in a position of danger, and be spoken against; but there will be no error."
      },
      "2": {
        "position": "second",
        "type": "six",
        "text": "shows the geese gradually approaching the large rocks, where they eat and drink joyfully and at ease. There will be good fortune."
      },
      "3": {
        "position": "third",
        "type": "nine",
        "text": "shows them gradually advanced to the dry plains. It suggests also the idea of a husband who goes on an expedition from which he does not return, and of a wife who is pregnant, but will not nourish her child. There will be evil. The case symbolised might be advantageous in resisting plunderers."
      },
      "4": {
        "position": "fourth",
        "type": "six",
        "text": "shows the geese gradually advanced to the trees. They may light on the flat branches. There will be no error."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "shows the geese gradually advanced to a high mound. It suggests the idea of a wife who for three years does not become pregnant; but in the end the natural issue cannot they prevented. There will be good fortune."
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows the geese gradually advanced to the large heights beyond. Their feathers can be used as ornaments. There will be good fortune."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}