{
  "hexagram_id": "hexagram_08",
  "number": 8,
  "king_wen_sequence": 8,
  "fu_xi_sequence": 8,
  "binary": "010000",
  "trigrams": {
    "upper": "kan",
    "lower": "kun"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Pi",
    "english_name": "Concord",
    "title": "8. Pi / Concord",
    "judgment": "Pi indicates that under the conditions which it supposes, there is good fortune. But let the principal party intended in it re-examine themselves, as if by divination, even if their virtue is great, unremitting, and firm. If it be so, there will be no error. Those who have no rest will then come to them; and with those who are too late in coming it will go ill.",
    "image": "The trigram representing the earth, and over it that representing water, form Pi. The ancient kings, in accordance with this, established the various states and maintained an affectionate relation to their leaders.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows its subject seeking by their sincerity to win the attachment of their target. There will be no error. Let the breast be full of sincerity as an earthenware vessel is of its contents, and it will in the end bring other advantages."
      },
      "2": {
        "position": "second",
        "type": "six",
        "text": "we see the movement towards union and attachment proceeding from the inward mind. With firm correctness there will be good fortune."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "we see its subject seeking union with such as ought not be associated with."
      },
      "4": {
        "position": "fourth",
        "type": "six",
        "text": "we see its subject seeking for union with the one beyond themself. With firm correctness there will be good fortune."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "affords the most illustrious instance of seeking union and attachment. We seem to see in it the king urging his pursuit of the game only in three directions, and allowing the escape of all the animals before him, while the people of his towns do not warn one another to prevent it. There will be good fortune."
      },
      "6": {
        "position": "topmost",
        "type": "six",
        "text": "we see one seeking union and attachment without having taken the first step to such an end. There will be evil."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}