{
  "hexagram_id": "hexagram_11",
  "number": 11,
  "king_wen_sequence": 11,
  "fu_xi_sequence": 11,
  "binary": "000111",
  "trigrams": {
    "upper": "kun",
    "lower": "qian"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "T'ai",
    "english_name": "Peace, Restful Fluidity",
    "title": "11. T'ai / Peace, Restful Fluidity",
    "judgment": "In T'ai we see the small gone and the great coming. It indicates that there will be good fortune, with progress and success.",
    "image": "The trigrams for heaven and earth in communication together form T'ai. The sage sovereign, in harmony with this, fashions and completes their regulations after the courses of heaven and earth, and assists the application of the adaptations furnished by them, in order to benefit the people.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "nine",
        "text": "suggests the idea of grass pulled up, and bringing with it other stalks with whose roots it is connected. Advance on the part of its subject will be fortunate."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows one who can empathise with the uncultivated, will cross the Ho without a boat, does not forget the distant, and has no selfish friendships. Thus do they prove themselves to be acting in accordance with the course of correctness."
      },
      "3": {
        "position": "third",
        "type": "nine",
        "text": "shows that, while there is no state of peace that is not liable to be disturbed, and no departure of evil people so that they shall not return, yet when one is firm and correct, as one realises the distresses that may arise, one will commit no error. There is no occasion for sadness at the certainty of such recurring changes; and in this mood the happiness of the present may be long enjoyed."
      },
      "4": {
        "position": "fourth",
        "type": "six",
        "text": "shows its subject fluttering down; not relying on their own rich resources, bur calling in their neighbours. They all come not as having received warning, but in the sincerity of their hearts."
      },
      "5": {
        "position": "fifth",
        "type": "six",
        "text": "reminds us of king Ti-yi's rule about the marriage of his younger sister. By such a course there is happiness and there will be great good fortune."
      },
      "6": {
        "position": "topmost",
        "type": "six",
        "text": "shows us the city wall returned into the moat. It is not the time to use the army. The subject of the line may, indeed, announce their orders to the people of their own city; but however correct and firm they may be, they will have cause for regret."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {
    "wilhelm_baynes": {
      "source_id": "wilhelm_baynes",
      "name": "[Hexagram 11 - Manual extraction needed]",
      "english_name": "[To be extracted]",
      "judgment": "[Wilhelm/Baynes judgment text to be extracted from source]",
      "image": "[Wilhelm/Baynes image text to be extracted from source]",
      "lines": {
        "1": {
          "position": "bottom",
          "type": "nine",
          "text": "[Line 1 to be extracted]"
        },
        "2": {
          "position": "second",
          "type": "nine",
          "text": "[Line 2 to be extracted]"
        },
        "3": {
          "position": "third",
          "type": "nine",
          "text": "[Line 3 to be extracted]"
        },
        "4": {
          "position": "fourth",
          "type": "nine",
          "text": "[Line 4 to be extracted]"
        },
        "5": {
          "position": "fifth",
          "type": "nine",
          "text": "[Line 5 to be extracted]"
        },
        "6": {
          "position": "top",
          "type": "nine",
          "text": "[Line 6 to be extracted]"
        }
      },
      "metadata": {
        "translator": "Richard Wilhelm / Cary F. Baynes",
        "year": 1950,
        "language": "en",
        "extraction_date": "2025-11-18",
        "verified": false,
        "manual_extraction_required": true,
        "url": "http://www2.unipr.it/~deyoung/I_Ching_Wilhelm_Translation.html"
      }
    }
  }
}