{
  "hexagram_id": "hexagram_38",
  "number": 38,
  "king_wen_sequence": 38,
  "fu_xi_sequence": 38,
  "binary": "101011",
  "trigrams": {
    "upper": "li",
    "lower": "dui"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "K'ouei",
    "english_name": "Opposition",
    "title": "38. K'ouei / Opposition",
    "judgment": "K'ouei indicates that, notwithstanding the condition of things which it denotes, in small matters there will still be good success.",
    "image": "The trigram representing fire above, and that for the waters of a marsh below, form K'ouei. The superior person, in accordance with this, where there is a general agreement, yet admits diversity.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "nine",
        "text": "shows that for its subject occasion for repentance will disappear. They have lost their horses, but let them not seek for them; they will return of themselves. Should they meet with bad people, they will not err in communicating with them."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows its subject happening to meet with their lord in a bye-passage. There will be no error."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows one whose carriage is dragged back, while the oxen in it are pushed back, and they are themselves subjected to the shaving of their head and the cutting off of their nose. There is no good beginning, but there will be a good end."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows its subject solitary amidst the prevailing disunion, but they meet with the good person represented by the first line, and they blend their sincere desires together. The position is one of peril, but there will be no mistake."
      },
      "5": {
        "position": "fifth",
        "type": "six",
        "text": "shows that for its subject occasion for repentance will disappear. With their relative and minister they unite closely and readily as if they were biting through a piece of skin. When they go forward with this help, what error could there be?"
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows its subject solitary amidst the prevailing disunion. In the subject of the third line, they seem to see a pig bearing on its back a load of mud, or fancy there is a carrriage full of ghosts. They first bend their bow against them, and afterwards unbend it, for they discover that there is not an assailant to injure, but a near relative. Going forward, they shall meet with genial rain, and there will be good fortune."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}