{
  "hexagram_id": "hexagram_29",
  "number": 29,
  "king_wen_sequence": 29,
  "fu_xi_sequence": 29,
  "binary": "010010",
  "trigrams": {
    "upper": "kan",
    "lower": "kan"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "K'an",
    "english_name": "The Abyss, Danger",
    "title": "29. K'an / The Abyss, Danger",
    "judgment": "K'an, here repeated, shows the possession of sincerity, though which the mind is penetrating. Action in accordance with this will be of high value.",
    "image": "The representation of water flowing on continuously forms the repeated K'an. The superior person, in accordance with this, maintains constantly the virtue of their heart and the integrity of their conduct, and practises the business of instruction.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows its subject in the double abyss, and yet entering a cavern within it. There will be evil."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows its subject in all the peril of the abyss. They will, however, get a little of the deliverance that they seek."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows its subject, whether they come or go, descend or ascend, confronted by an abyss. All is peril to them and unrest. Their endeavours will lead them into the cavern of the pit. There should be no action in such a case."
      },
      "4": {
        "position": "fourth",
        "type": "six",
        "text": "shows its subject at a feast, with simply a bottle of spirits and a subsidiary basket of rice, while the cups and howls are only of earthenware. The important lessons are introduced as their ruler's intelligence admits. There will in the end be no error."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "shows the water of the abyss not yet full, so that it might flow away; but order will soon be brought about. There will be no error."
      },
      "6": {
        "position": "topmost",
        "type": "six",
        "text": "shows its subject bound with cords of three strands or two strands, and placed in a thicket of thorns. Still in three years they do not learn the course for them to pursue. There will be evil."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}