{
  "hexagram_id": "hexagram_64",
  "number": 64,
  "king_wen_sequence": 64,
  "fu_xi_sequence": 64,
  "binary": "101010",
  "trigrams": {
    "upper": "li",
    "lower": "kan"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Wei Tchi",
    "english_name": "Before The Achievement",
    "title": "64. Wei Tchi / Before The Achievement",
    "judgment": "Wei Tchi intimates progress and success in the circumstances which it implies. We see a young fox that has nearly crossed the stream, when its tail gets immersed. There will be no advantage in any way.",
    "image": "The trigram representing water, and that for fire above it, form Wei Tchi. The superior person, in accordance with this, carefully discriminates among the qualities of things, and the different positions they naturally occupy.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows its subject with occasion for regret."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows its subject dragging back their carriage-wheel. With firmness and correctness there will be good fortune."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows its subject, with the state of things not yet remedied, advancing on; which will lead to evil. But there will be advantage in trying to cross the great stream."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows its subject by firm correctness obtaining good fortune, so that all occasion for repentance disappears. Let them stir themselves up, as if they were invading the Demon region, where for three years rewards will come to them and their troops from the great kingdom."
      },
      "5": {
        "position": "fifth",
        "type": "six",
        "text": "shows its subject by firm correctness obtaining good fortune, and having no occasion for repentance. We see in them the brightness of a superior person, and the possession of sincerity. There will be good fortune."
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows its subject full of confidence and therefore feasting quietly. There will be no error. But if they cherish this confidence, till they are like the fox who gets their head immersed, it will fail of what is right."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}