{
  "hexagram_id": "hexagram_13",
  "number": 13,
  "king_wen_sequence": 13,
  "fu_xi_sequence": 13,
  "binary": "111101",
  "trigrams": {
    "upper": "qian",
    "lower": "li"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Tong Jen",
    "english_name": "Community",
    "title": "13. Tong Jen / Community",
    "judgment": "Tong Jen or 'Community' appears here as we find it in the remote district of the country, indicating progress and success. It will be advantageous to cross the great stream. It will be advantageous to maintain the firm correctness of the superior person.",
    "image": "The trigrams for heaven and fire form Tong Jen. The superior person, in accordance with this, distinguishes things according to their kinds and levels.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "nine",
        "text": "shows the representative of the community just issuing from their gate. There will be no error."
      },
      "2": {
        "position": "second",
        "type": "six",
        "text": "shows the representative of the community in relation with their kindred. There will be occasion for regret."
      },
      "3": {
        "position": "third",
        "type": "nine",
        "text": "shows its subject with their arms hidden in the thick grass, and at the top of a high mound. But for three years they make no demonstration."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows its subject mounted on the city wall; but they do not proceed to make the attack they contemplate. There will be good fortune."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "the representative of the community first wails and cries out, and then laughs. Their great host conquers, and they and the subject of the second line meet together."
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows the representative of the community in the suburbs. There will be no occasion for repentance."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}