{
  "hexagram_id": "hexagram_59",
  "number": 59,
  "king_wen_sequence": 59,
  "fu_xi_sequence": 59,
  "binary": "110010",
  "trigrams": {
    "upper": "xun",
    "lower": "kan"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Houan",
    "english_name": "The Dissolution, The Scattering",
    "title": "59. Houan / The Dissolution, The Scattering",
    "judgment": "Houan intimates that under its conditions there will be progress and success. The king goes to their ancestral temple; and it will be advantageous to cross the great stream. It will be advantageous to be firm and correct.",
    "image": "The trigram representing water, and that for wind moving above the water, form Houan. The ancient kings, in accordance with this, presented offerings to the deity and established the ancestral temple.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows its subject engaged in rescuing from the impending evil, and having the assistance of a strong horse. There will be good fortune."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows its subject, amid the dispersion, hurrying to their contrivance for security. All occasion for repentance will disappear."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows its subject discarding any regard to their own person. There will be no occasion for repentance."
      },
      "4": {
        "position": "fourth",
        "type": "six",
        "text": "shows its subject scattering the different parties in the the state; which leads to great good fortune. From the dispersion they collect again good people standing out, a crowd like a mound, which is what ordinary folk would not have thought of."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "shows its subject amidst the dispersion issuing their great announcements as the perspiration flows from their body. They scatter abroad also the accumulation in the royal granaries. There will be no error."
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows its subject disposing of what may be called its bloody wounds, and going and separating themselves from their anxious fears. There will be no error."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}