{
  "hexagram_id": "hexagram_43",
  "number": 43,
  "king_wen_sequence": 43,
  "fu_xi_sequence": 43,
  "binary": "011111",
  "trigrams": {
    "upper": "dui",
    "lower": "qian"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Kouai",
    "english_name": "Resolution",
    "title": "43. Kouai / Resolution",
    "judgment": "Kouai requires in those who would fulfil its meaning the exhibition of the culprit's guilt in the royal court, and a sincere and earnest appeal for sympathy and support, with a consciousness of the peril involved in cutting off the criminal. They should also make announcement in their own city, and show that it will not be well to have recourse at once to arms. In this way there will be advantage in whatever they shall proceed with.",
    "image": "The trigram representing heaven, and that for the waters of a marsh mounting above it, form Kouai. The superior person, in accordance with this, bestows emoluments on those below them, and dislike allowing their gifts to accumulate undispensed.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "nine",
        "text": "shows its subject in the pride of strength advancing with their toes. They go forward, but will not succeed. There will be ground for blame."
      },
      "2": {
        "position": "second",
        "type": "nine",
        "text": "shows its subject full of apprehension and appealing for sympathy and help. Late at night hostile measures may be taken against them, but they need not they anxious about them."
      },
      "3": {
        "position": "third",
        "type": "nine",
        "text": "shows its subject about to advance with strong and determined looks. There will be evil. The superior person, bent on cutting off the criminal, will walk alone and encounter the rain till they are hated by their proper associates as if they were contaminated by the criminals. In the end there will be no blame against them."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows one from whose buttocks the skin has been stripped, and who walks slowly and with difficulty. If they could act like a sheep led after its companions, occasion for repentance would disappear.  But though they hear these words, they will not believe them."
      },
      "5": {
        "position": "fifth",
        "type": "nine",
        "text": "shows the small men like a bed of weeds, which ought to be uprooted with the utmost determination. If the subject of the line has such determination, their action, in harmony with their central position, will lead to no error or blame."
      },
      "6": {
        "position": "topmost",
        "type": "six",
        "text": "shows its subject without any helpers on whom to call. Their end will be evil."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}