{
  "hexagram_id": "hexagram_35",
  "number": 35,
  "king_wen_sequence": 35,
  "fu_xi_sequence": 35,
  "binary": "101000",
  "trigrams": {
    "upper": "li",
    "lower": "kun"
  },
  "canonical": {
    "source_id": "legge_1882",
    "name": "Tchin",
    "english_name": "Progress",
    "title": "35. Tchin / Progress",
    "judgment": "In Tchin we see a prince who secures the tranquillity of the people presented in reward with numerous horses by the king, and three times in a day received at interviews.",
    "image": "The trigram representing the earth, and that for the bright sun coming forth above it, form Tchin. The superior person, according to this, gives themself to making more brilliant their bright virtue.",
    "lines": {
      "1": {
        "position": "bottom",
        "type": "six",
        "text": "shows one wishing to advance, and at the same time kept back. Let them be firm and correct, and there will be good fortune. If trust does not abide in them, let them maintain a large and generous mind, and there will be no error."
      },
      "2": {
        "position": "second",
        "type": "six",
        "text": "shows its subject with the appearance of advancing, and yet of being sorrowful. If they be firm and correct, there will be good fortune. They will receive this great blessing from their grandmother."
      },
      "3": {
        "position": "third",
        "type": "six",
        "text": "shows its subject trusted by all around them. All occasion for repentance will disappear."
      },
      "4": {
        "position": "fourth",
        "type": "nine",
        "text": "shows its subject, however firm and correct they may be, in a position of peril."
      },
      "5": {
        "position": "fifth",
        "type": "six",
        "text": "shows how all occasion for repentance disappears from its subject, but let them not concern themselves about whether they shall fail or succeed. To advance will be fortunate, and in every way advantageous."
      },
      "6": {
        "position": "topmost",
        "type": "nine",
        "text": "shows one advancing their horns. But they only use them to punish the rebellious people of their own city. The position is perilous, but there will be good fortune. Still, however firm and correct they may be, there will be occasion for regret."
      }
    },
    "metadata": {
      "translator": "James Legge",
      "year": 1882,
      "language": "en",
      "verified": true,
      "notes": "Original translation preserved from pyChing v1.2.2"
    }
  },
  "sources": {}
}